markdown lint fixes
